CSI API ETABS v1
e2DFrameType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum e2DFrameType
Public Enumeration e2DFrameType
Dim instance As e2DFrameType
public enum class e2DFrameType
type e2DFrameType
Members
Member name | Value | Description
PortalFrame | 0
ConcentricBraced | 1
EccentricBraced | 2
See Also
Reference
ETABSv1 Namespace